BaseManagementofITcompany/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

BaseManagementofITcompany/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

BaseManagementofITcompany/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

	// ++ 2026.02 Ливенцев правки 
	//Добавляет новые элементы на форму програмно
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	УстановитьВидимость(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьНовыеЭлементыФормы()
	
	// Создание групп
	Если Элементы.Найти("АдоненскоеОбслуживание") = Неопределено Тогда
		АдоненскоеОбслуживание = Элементы.Добавить("АдоненскоеОбслуживание", Тип("ГруппаФормы"),ЭтотОбъект);
		АдоненскоеОбслуживание.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		АдоненскоеОбслуживание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		АдоненскоеОбслуживание.ОтображатьЗаголовок = Ложь;
		АдоненскоеОбслуживание.Отображение = ОтображениеОбычнойГруппы.Нет;
		
		АдоненскоеОбслуживаниеСтоимость = Элементы.Добавить("АдоненскоеОбслуживаниеСтоимость", Тип("ГруппаФормы"),ЭтотОбъект);
		АдоненскоеОбслуживаниеСтоимость.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		АдоненскоеОбслуживаниеСтоимость.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		АдоненскоеОбслуживаниеСтоимость.ОтображатьЗаголовок = Ложь;
		АдоненскоеОбслуживаниеСтоимость.Отображение = ОтображениеОбычнойГруппы.Нет;
	КонецЕсли;
	
	Если Элементы.Найти("ДатаНачала") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ДатаНачала", Тип("ПолеФормы"),АдоненскоеОбслуживание );
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеПериода;
		НовыйЭлемент.Заголовок = "Дата начала";
	КонецЕсли;
	
	Если Элементы.Найти("ДатаОкончания") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ДатаОкончания", Тип("ПолеФормы"),АдоненскоеОбслуживание );
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеПериода;
		НовыйЭлемент.Заголовок = "Дата окончания";
	КонецЕсли;
	
	Если Элементы.Найти("СуммаАбонентскойПлаты") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"),АдоненскоеОбслуживаниеСтоимость);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Сумма";
	КонецЕсли;
	
	Если Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), АдоненскоеОбслуживаниеСтоимость);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Стоимость часа";
	КонецЕсли;
	
	УстановитьВидимость(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Форма)
	Форма.Элементы.АдоненскоеОбслуживаниеСтоимость.Видимость = Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание");
	Форма.Элементы.АдоненскоеОбслуживание.Видимость = Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание");
КонецПроцедуры
	// -- 2026.02 Ливенцев правки
	
#КонецОбласти
